
var documents = [{
    "id": 0,
    "url": "http://localhost:4000/404.html",
    "title": "404",
    "body": "404 Page not found!Please use the search bar from the bottom left or visit our homepage! "
    }, {
    "id": 1,
    "url": "http://localhost:4000/about",
    "title": "Memoirs, a free minimalist Jekyll blogging theme with modern design",
    "body": "This website is a demonstration to see Memoirs Jekyll theme in action. The theme is compatible with Github pages, in fact even this demo itself is created with Github Pages and hosted with Github.  Get Memoirs for Jekyll → "
    }, {
    "id": 2,
    "url": "http://localhost:4000/authors",
    "title": "Authors",
    "body": "                                                                                                                  Alfredo:         Ultralight backpacking, fastpacking enthusiast.                "
    }, {
    "id": 3,
    "url": "http://localhost:4000/categories",
    "title": "Categories",
    "body": ""
    }, {
    "id": 4,
    "url": "http://localhost:4000/contact",
    "title": "Contact",
    "body": "  Please send your message to Memoirs. We will reply as soon as possible!   "
    }, {
    "id": 5,
    "url": "http://localhost:4000/",
    "title": "Home",
    "body": "                                                                                               20230910-0913 東霸尖山              :       行程計畫:                                                                               Alfredo                 10 Sep 2023                                                                                                                           202300604-20230605 志佳陽上雪主O型              :       武陵農場上志佳陽雪主O型:                                                                               Alfredo                 03 Jun 2023                                                                                                                           營地生活              :       營地生活:                                                                               Alfredo                 19 May 2023                                                                                                                           2023 Challenge Taiwan 113              :       2023 Challenge Taiwan 113:                                                                               Alfredo                 23 Apr 2023                                                                                                                           登山輕量化糧食規劃 - 晚餐              :       登山輕量化糧食規劃 - 晚餐在輕量化登山中, 飲食常常是被犧牲的一塊, 在早期嘗試輕量化行程中我也是這樣, 常常就乾燥飯, 泡麵, 幾塊巧克力就上山; 結果就是攝取的養分/熱量不足, 導致恢復不足, 接下來的行程就常常處於暴掉的狀態. 當然恢復這方面這跟個人平時的訓練以及年齡有很大的關係; 如果你夠年輕, 也有足夠的訓練, 那你可能可以用最輕量的食材撐過你的行程; 這方面講下去又會是長篇大論, 這邊就先略過, 因此這篇文章的標的族群就是像我這樣, 四/五十歲左右的中年人, 恢復力已不復年輕時皮球反彈般強勁, 但平時都有固定的訓練(包括有氧, 肌力, 無氧衝刺等). :                                                                               Alfredo                 04 Apr 2023                                                                                                                           20230311-20230313 盆馬秀O型              :       盆馬秀O型東埔-對關-龍貓公車-郡大溪底-盆駒山-馬博拉斯山-秀姑巒山-東埔:                                                                               Alfredo                 15 Mar 2023                                   &laquo;          1        2       &raquo; "
    }, {
    "id": 6,
    "url": "http://localhost:4000/robots.txt",
    "title": "",
    "body": "      Sitemap: {{ “sitemap. xml”   absolute_url }}   "
    }, {
    "id": 7,
    "url": "http://localhost:4000/page2/",
    "title": "Home",
    "body": "  {% for post in paginator. posts %}    {% include postbox. html %}  {% endfor %}  {% include pagination. html %}"
    }, {
    "id": 8,
    "url": "http://localhost:4000/%E6%9D%B1%E9%9C%B8%E5%B0%96%E5%B1%B1/",
    "title": "20230910-0913 東霸尖山",
    "body": "2023/09/10 - 行程計畫: Day1: 武陵-新達山屋  0900 - 1400 武陵-新達山屋 8km, ascend 1477m, descent 206m, 6hrs, 行程定數 28 Day2: 新達山屋-霸南山屋 0800 - 1200 新達山屋-霸南山屋 4. 1km, ascend 474m, descend 541m, 5hrs, 行程定數 15. 2 Day3: 霸南山屋-東霸尖山-霸南山屋  0400 - 0800 霸南山屋-東霸尖山塔克金溪底 (8點前未達溪底則撤退) 0800 - 1100 東霸尖山塔克金溪底-東霸尖山 1100 - 1300 東霸尖山-東霸尖山塔克金溪底 1300 - 1700 東霸尖山塔克金溪底-霸南山屋 6. 9km, ascend 1543m, descend 1543m, 10hrs, 行程定數 36. 39 Day4: 霸南山屋-武陵  0600-1000 霸南山屋-新達山屋 1000-1400 新達山屋-武陵 11. 8km, ascend 738m, descend 1946m, 10hrs, 行程定數 29. 7 裝備表: https://lighterpack. com/r/mdrwyd 天氣預報: 預計前兩天應該都是陰雨天, 後面天氣會逐漸轉好, 倒吃甘蔗. 雲高大於3000公尺, 看到雲海的機會不大. 氣溫夜晚10度, 白天20度左右, 因此決定穿著短袖羊毛衣行進, 晚上再換上長袖底層衣. 參考資料:  https://hiking. biji. co/index. php?q=review&amp;act=info&amp;review_id=17965 https://m. xuite. net/blog/paichiawu/twblog/588613702?fbclid=IwAR2qGC6aXeiqKyaI6JckYdyXir6q7Ffg-lUzpk8V-_SMv3u78t7uO_3gPIc https://hiking. biji. co/index. php?q=review&amp;act=info&amp;review_id=18331&amp;fbclid=IwAR0nW5euaJLHVJOYB4wBhel-4ilAma-Ywksh-tZRj-r35x-HeJ_805-vRfc實際行程: Day 1: 1000 武陵山莊出發 池有山開始的陡上, 同行夥伴回眸一笑. 1400 經過三叉營地, 開始下小雨. 從登山口走到這爬升已經破千了, 花了約3個小時, 沒特別催馬力, 算是輕鬆愉快的速度. 白牆版的池有名樹… :(往新達山屋的路況比我想像中還難一些, 本來以為是平緩好走的稜線山徑, 結果路上都是大大小小的石瀑跟高低繞的山徑, 加上霧雨綿綿, 走的我都有點心煩… 1530 抵達新達山屋接近日落時的新達營地, 可惜太陽被池有山擋住了, 不然這邊是一個不錯的營地. 後續於山屋中陸陸續續遇到一群單攻的大哥大姐們, 全身都溼透了, 幸好有一位女山友幫忙燒熱水跟零食幫忙補給, 要不然一旦失溫就會很危險. 晚上約8點多時又有一組人從桃山過來, 也是全身都溼透了, 晚上摸黑到這甚是辛苦. 本來計畫在外面紮營, 但是遇到下雨, 就打消念頭住回山屋, 人多難免彼此干擾, 當晚果然沒睡好. Day 2: 0700 起登 早上天氣大好, 陽光普照, 天空湛藍, 一掃昨天的陰雨綿綿. 好天氣的池有山跟新達池, 新達池是一個看天池, 還不小, 但是水質不是很好, 除非不得已才會去取用. 從山屋後面就可以看見此行的目標, 右邊的山頭就是東霸第四峰, 東霸尖山, 從這邊開始路徑就一路抖下到塔克金溪底. 秀霸線下塔克金溪後, 再陡上接回大壩線, 沿路上的景觀在陽光的照耀下, 整個森林都閃閃發光. 同行夥伴拍的, 在陽光照耀下, 綠到極致的青苔. 大約11點就抵達霸南山屋, 早早煮完午餐就泡茶喝. 大鹿林道因崩塌封閉, 所以今天就由我們包下整個山屋. Day 3: 一大早約4點左右出發, 對我而言有點早, 獨攀時其實都會等到天亮才出發. 途中經過的地方因為摸黑, 所以都沒什麽印象, 其實我不是很喜歡這種爬山方式, 不過一般登山客似乎都習以為常, 這也是我比較偏好獨攀的原因之一. 抵達ILoveYou平台時才5點出頭. 從IloveYou平台到東霸下切口還要走一小段路, 路跡不是很明顯, 花了一點時間才找到正確的入口. 下切口往下看, 那深深的谷底, 深吸一口氣就直接下去. 一開始是很細很細的碎石, 可以一路嚕下去, 我看網路上的影片想依樣畫葫蘆想很久了. 不過回程時這一段就慘了, 走兩步退一步, 到後來只能扶著旁邊的岩壁走. 到中段就會遇到從邊大壩流下來的飛瀑, 甚是壯觀, 可惜太陽沒照進來. 下切後段石頭也逐漸的變大, 也容易滾動, 跟隊友就切不同的路徑下, 避免踢下的滾石造成危險. 這時陽光也照上了旁邊的山頭, 黃金大壩. 切到底抵達雙溪匯流處, 中間偏左邊的山頭就是目的地. 從這邊就要過溪, 看見東霸尖山的登山口開始陡升. 這一段路一開始混雜了台灣中級山林相雜亂的特色, 然後中間不算短的滾石碎石坡, 跟一些需要點抱石技巧的地形, 路徑也不是很清楚, 偶爾還要對照 gps 找路, 整體上不是很好走. 途中休息時, 遇到猴板凳一家七口. 上了東霸的稜線後, 箭竹密佈, 回程時還在這邊走叉了路, 小小迷路了一下. 經過快3個小時的努力, 在早上9點多終於到達山頂, 累… 只能跪了… XD 從這個角度看大小霸, 大概只有爬上東霸的人才能欣賞到吧 :) 怎麼來的就要怎麼回去, 剛剛所有經過的地形都要倒帶一次. 不同的是, 困難的依然困難, 容易的確變成難的. 雖然是下山, 但是花的時間沒有比上來少多少, 而且還要時時注意是否走過頭. 下切到匯流口後已經中午了, 就跟夥伴找地方休息吃乾糧, 準備最後的上切600m. 大約半小時後出發, 花了1個多小時慢慢的爬回到早上的飛瀑區. 從凌晨4點到現在, 大家也都累了, 所以我每一百公尺就休息一下, 希望能在下午後雷陣雨之前爬完這一段. 最後的微小碎石坡已經不能直接走上去了, 走三步退兩步, 只能扶著岩壁冒著落石的風險慢慢而上. 終於在2點半爬回當初下切的巨石, 終於完成這一趟困難的行程, 興奮的大喊. 爬上來後決定跳上下切的這塊巨岩拍照留念. 最後再花了約1個半小時趕回霸南山屋, 抵達山屋大約3點多, 足足花了11個小時來回. 12多公里的行程, 爬升超過1200m, 加上一堆地形, 疲憊感很高, 在山屋坐著坐著就睡著了. Day 4: 這一天就是單純的原路來回, 天氣大好, 不知不覺的加快腳步, 早上5點出發下午約2點就抵達車子旁. 然後就去露營區盥洗了一番後回程. 後記:  天氣, 跟之前預估的差不多, 第一天霧雨, 之後漸入佳境, 天氣大好.  氣溫約15度上下, 晚上約10度, 穿著短袖羊毛底層衣加上 Hike Right 防曬衣行進剛剛好.  吃完的包裝還蠻重的, 約100g重, 這部份可以將包裝事先拆掉來改善, 但是犧牲了保存的品質.  吃的部份, 台酒泡麵大推. 堅果依然沒吃完, 大概是之前只吃堅果吃到怕了. 鱈魚香絲可. 早上咖啡加上 whisky 很棒, 驅寒又有酒香. "
    }, {
    "id": 9,
    "url": "http://localhost:4000/%E5%BF%97%E4%BD%B3%E9%99%BD%E4%B8%8A%E9%9B%AA%E4%B8%BB/",
    "title": "202300604-20230605 志佳陽上雪主O型",
    "body": "2023/06/03 - 武陵農場上志佳陽雪主O型: 自從雪山西稜經過翠池之後, 一直很想再去翠池住一晚, 看看那落日時的黃金北稜角跟那片漂亮的玉山園柏林. 查查住宿點, 369 似乎都是處於滿載的狀態, 於是就動念從志佳陽上的念頭, 只是志佳陽的登山口離武陵農場有一段距離, 看了一下地圖, 發現武陵農場內有一條路可以通往志佳陽, 只是比較少人走, 便有了這次行程. 車停露營區後, 往武陵農場山走, 小跑步約4公里就抵達登山口, 一開始就是不囉唆的直接陡上.  武陵農場山基點, 到這邊天氣炎熱, 周圍都是中級山的景緻, 渾然不知過幾個小時後大風大雨的慘況.  途中經過一片蕨類植物區, 應該是後來開闢的防火巷. 馬武霸主峰前是標準的中級山路徑, 看起來到到處都是路, 還好路條還不少. 過主峰後就是比人高的箭竹林擋道, 而且還是逆向長, 大概是因為很少人會跟我一樣從山下爬上去.  到達瓢簞山屋已是一片淒風苦雨, 一片白牆, 又經過剛剛的箭竹海洗禮, 心裡想著要不要在山屋外面迫降一晚.  沒多久一群大隊人馬也抵達山屋, 內外頓時吵鬧了起來, 考慮了幾分鐘, 決定繼續向前推進, 往雪山山屋舊址營地走. 時間已經下午4點多, 天色慢慢變暗加上天氣不佳, 經過志佳陽三角點匆匆的拍了照就繼續趕路.  晚上10點左右開始傾盆大雨, 非常大非常大的那種, 我的 zpack 小天幕明顯的撐不太住這種雨勢, 雨水慢慢飛濺到睡墊跟睡被上. 雨勢從半夜一直下到隔天約 4 點才逐漸轉小, 我的睡被也差不多溼了一半, 還好還勉強撐的住. 天亮打開天幕門, 營地附近也積了小水窪, 全身上下裝備也溼了差不多, 心裡打定主意上雪主後就馬上下徹, 原本的翠池就只好下次再來.  雨過天晴, 早上空氣景色十分的漂亮, 營地後方的雪主清晰可見.  事前準備時知道從營地上雪主的溪溝路不好走, 除了落差以及路跡不明外, 陡峭的爬升, 高海拔體力的降低以及肩上那吸滿水汽的背包更是加劇這短短 3 公里路徑的難度.  不過路上的景色令人非常驚豔, 艱困的地形帶來壯麗的景觀.  沿路上百前年的大火而乾枯的玉山圓柏林, 彷彿浴火焚身掙扎扭動, 帶來一種超現實感.   經過 2 個多小時的掙扎, 終於爬上這段短短 3 公里的山徑, 因為擔心午後的雷陣雨, 就開啟快速下滑模式, 約中午左右抵達大水池登山口. 後記:    zpack hexamid 天幕在豪大雨中效能不佳, 需要找一個能對抗天候的天幕.     可以考慮化纖睡被, 大約是 5 度左右的適溫, 避免吸滿水汽而造成保溫效果不佳的問題.  "
    }, {
    "id": 10,
    "url": "http://localhost:4000/%E7%87%9F%E5%9C%B0%E7%94%9F%E6%B4%BB/",
    "title": "營地生活",
    "body": "2023/05/19 - 營地生活對我而言, 百岳數不是非常重要, 但是紮營在一個風景優美的地方過夜是比攻頂還重要的; 像之前去走戒茂斯上嘉明湖, 除了嘉明湖外, 另一個重點就是想在高爾夫球場過夜一晚. 大多數人應該都是已攻頂為主, 能睡山屋就盡量睡山屋, 我則是能自己紮營就不睡山屋, 這也是我會選擇獨攀的原因之一 (因為很難找到跟我相同癖好的人啊…). 戒茂斯高爾夫球場日出. 當然營地可以選在樹林中, 松針鋪地是最好, 如果海拔夠高, 早上還可以看見日出的陽光照進天幕裡, 在這種情境下醒來是令人心情愉悅不過了. 這時再泡杯咖啡, 漫步或小坐在營地周圍, 呼吸著清晨冷冷的空氣, 幸福感滿滿. 所以我爬山基本上都不摸黑, 早上花個一小時慢慢品嚐清晨的滋味, 非常值得. 布新營地往布拉克桑山途中的松針營地. 而在中海拔的高度, 晚上聽著森林中各式各樣小動物或鳥叫聲, 地上落葉偶而傳來稀稀疏疏的腳步聲, 伴著入眠, 是活在都市中完全想像不到的. 盆駒山西稜2140m營地 塔曼山山頂三角點附近. 湖邊的晨光更是難得, 就算天幕因返潮溼了整片都無所謂, 畢竟湖景第一排不是到處都有的. 加羅湖畔.  棲蘭池. "
    }, {
    "id": 11,
    "url": "http://localhost:4000/Challenge_Taiwan_113/",
    "title": "2023 Challenge Taiwan 113",
    "body": "2023/04/23 - 2023 Challenge Taiwan 113: 每年參加半超鐵的比賽, 已經變成一種習慣, 當初的目的是讓自己有個保持運動的目標; 不過這幾年對多天數登山開始有了興趣, 運動的重心跟訓練也朝向這方面發展, 鐵人比賽漸漸變成單純的朋友聚會, 自然這方面的訓練就慢慢的放下了. 單車一個星期僅僅騎個兩次各一小時, 主要是拿來轉換跑步肌群; 游泳則是因為氯水過敏, 完全沒練. 賽前一個月, 一同參加賽事的朋友約了團練, 從去年比賽後的唯二兩次外騎; 賽前一週, 去游泳池隨便扒了兩次水, 就這樣佛系練法, 懷著輕鬆完賽的心情下台東. 由於練習量不足, 所以打定主意前兩項慢慢來, 以不影響跑步的節奏進行, 最後一項的路跑能追回多少就算多少. 游泳對曾經受過救生訓的人而言, 活水湖就只是一個大游泳池, 完全不會有任何恐懼感. 下水前按慣例擠到中線人較少的地方, 一路上就輕鬆游, 遇到慢的蛙腳就想辦法從旁邊穿過去, 定位也是一路找蛙泳的人當成定位點, 就這樣順順利利的用48分鐘划完1900m, 輕鬆愉快沒壓力的上岸. 單車這次單車策略很單純, 去程140W心跳130以下, 回程視情況拉高一些些. 全程騎的非常保守, 去程就一直被人刷卡, 回程就換我刷那些人; 總之就是安全輕鬆的方式完成單車段. 跑步算是我有在練的項目, 天氣陰涼, 是適合跑步的好天氣, 我也照例赤足跑; 一出發就可以拉到4分45左右的速度, 不過跑了快兩公里發現開始又抽筋的感覺, 只好把速度降到5分做左右. 遇到可以沖水的水站就老實不客氣的拿水瓢沖涼, 這就是赤足跑得好處, 不用擔心鞋子溼掉. 就這樣一直到17K左右抽筋感再次來襲, 只好再降速; 直到終點前一K左右, 跟一位跑者一起做最後衝刺, 大約衝到4分~到4分半左右, 竟然在終點前300公尺被攔下來停紅綠燈, 再次起跑時只好看著對方揚長而去. 到終點大小腿就發作開始大抽筋, 只好原地坐站了10來分鐘才能動. 總結這次算是正常表現, 天氣也夠涼爽, 不然天氣一熱我就很容易熱當. 當然, 平平安安完賽才是最重要的, 接下來可以好好去規劃爬山行程了.  "
    }, {
    "id": 12,
    "url": "http://localhost:4000/%E7%99%BB%E5%B1%B1%E8%BC%95%E9%87%8F%E5%8C%96%E7%B3%A7%E9%A3%9F%E8%A6%8F%E5%8A%83-%E6%99%9A%E9%A4%90/",
    "title": "登山輕量化糧食規劃 - 晚餐",
    "body": "2023/04/04 - 登山輕量化糧食規劃 - 晚餐在輕量化登山中, 飲食常常是被犧牲的一塊, 在早期嘗試輕量化行程中我也是這樣, 常常就乾燥飯, 泡麵, 幾塊巧克力就上山; 結果就是攝取的養分/熱量不足, 導致恢復不足, 接下來的行程就常常處於暴掉的狀態. 當然恢復這方面這跟個人平時的訓練以及年齡有很大的關係; 如果你夠年輕, 也有足夠的訓練, 那你可能可以用最輕量的食材撐過你的行程; 這方面講下去又會是長篇大論, 這邊就先略過, 因此這篇文章的標的族群就是像我這樣, 四/五十歲左右的中年人, 恢復力已不復年輕時皮球反彈般強勁, 但平時都有固定的訓練(包括有氧, 肌力, 無氧衝刺等). 再來, 一頓好的晚餐, 是對心靈上最好的激勵, 尤其是在一天的跋山涉水之後, 如果再面對食之乏味的餐點, 以及隔壁重裝營帳的大魚大肉, 那可是會讓人心靈遭受大受打擊… :) 廚具: 在輕量化思維下, 廚具通常也是會極簡化的, 一個高山爐頭, 110g的小型瓦斯罐, 600ml左右的鈦杯/鈦鍋, 以及鋁箔紙折成的鍋蓋足已. 我自己的配置為286克重 當然這方面可以再輕量下去, 那就是往酒精爐方面走, 不過安全方面需要多加小心, 尤其是酒精爐不易控制火量, 要有方法在需要時滅火. 下圖就是某次兩天戒茂斯出向陽所用的酒精爐, 一個MYOG的酒精爐, 12g酒精約可以燒開400ml的水; 左邊則是一個半剖的鋁罐, 有需要時蓋上酒精爐即可滅火, 整套爐具含鈦杯湯匙打火機總重136g. 再輕量下去, 就是所謂的cold soaking, 簡單說就是食物直接泡冷水吃. 這完全看個人的接受程度, 我是不行, 另一方面也不希望讓別人覺得輕量化就是要吃冷飯. Gossamer Gear的跨下鍋, 我都搞不清楚這是不是愚人節完笑了. 由於爐具精簡以及燃料的限制, 你在山上能做的烹煮方式也有限制, 快/省時就變成必要的需求, 在這條件下能做的往往就是煮水加熱. 由這個思維往下思考, 食物的選擇就有所侷限. 乾燥飯: 在台灣輕量化登山中常見的選擇, 但是不幸的是, 個人覺的口味不甚好, 營養成份常常只包含大量的碳水, 脂肪不足. 吃完後身體的感覺就會像是吃泡麵一樣, 感覺有吃進東西, 但是似乎補的不足, 少了些什麽一樣, 無法令人有滿足的感覺. 台灣的乾燥飯品牌我試了好幾款, 都是這樣. 據說歐美的比較好點, 不過我沒試過. 日系品牌口味稍好點, 還原度比較高. 泡麵: 泡麵也是我早期輕量化登山的主要糧食, 吃個一兩餐可能還好, 連續吃個兩天身體就有種”匱乏”的感覺. 不過泡麵條理包裡倒是含不少油脂, 香氣也很誘人. 我自己是把泡麵當成預備糧用, 然後在最後一天的早上吃掉… :P 料理包: 這是我目前的選擇, 除了料理方便, 口味佳, 還原度好, 加上市面上選擇眾多, 價格也比登山乾燥飯便宜許多. 下面這幾種是我目前在多天數行程中會加入的料理包.    味王紅燒牛腩, 目前我覺得口味最好的料理包, 200g重熱量219卡. 熱量/重量比來說稍微少一些, 但是味道很不錯, 由於重量較重, 我通常第一天晚上就會吃掉.     130g重500卡, 口味重, 目前吃過熱量/重量比最高的料理包, 加上麵條或乾燥飯就有7-800卡的熱量. 通常我會排在行程途中最累的那天吃.     大富貴黃金梓滷, 90g重350卡, 含大量的油脂但是沒有調味, 需加醬油等調味品. 這是最近找到另一款輕量高熱量的料理包, 熱量高但份量有點少, 吃的時候最好能加溫泉蛋或其他配料.  其他: 豬油油蔥酥拌飯: 90g約500-600卡, 90%全油脂, 市面上很容易就買到, 價格也便宜. 上山我都會帶上一小瓶跟醬油, 配合慈濟乾燥飯煮起來香味十足, 加顆溫泉蛋跟一點蔥花就很好吃. 營養組成: 油脂,油脂,油脂, 很重要所以講三次. 早期我只注重碳水, 忽略了油脂的重要性, 常常在行程的後期就很渴望油脂的補充. 後來比較深入的了解人的能量系統跟營養方面的補給後, 才發覺油脂的重要性, 輕量而且高熱量十分適合登山行程, 也是人類必須的營養品. 油脂的缺點就是能量供給比不上碳水來得快, 你必須把你的心率調整在有氧範圍內, 要不然強度過高血糖消耗完之後, 就必須休息等回血. 當然這可以用訓練來彌補, 平常可以刻意訓練拉高有氧閾值, 讓你在心率/功率增加的狀況仍然維持在有氧運動的範圍內. "
    }, {
    "id": 13,
    "url": "http://localhost:4000/%E7%9B%86%E9%A6%AC%E7%A7%80/",
    "title": "20230311-20230313 盆馬秀O型",
    "body": "2023/03/15 - 盆馬秀O型東埔-對關-龍貓公車-郡大溪底-盆駒山-馬博拉斯山-秀姑巒山-東埔 行前計畫: Day 1:  東埔-對關-郡大林道-廢棄公車-郡大溪底(盆駒西稜底)0700 - 東埔0830 - 對觀1030 - 郡大林道1100 - 廢棄公車1330 - 郡大溪底(盆駒西稜底) 行程定數: 32 (7小時) 住宿點: 郡大溪底 (DEM1675 / GPS1716 / 23. 55039 121. 00508) 或 2140 平台 (23. 550329, 121. 013147).  路線圖:Day 2:  盆駒西稜底-盆駒山-馬博拉斯山-秀姑巒山-白洋金礦山屋0530 - 盆駒西稜底0930 - 盆駒山1330 - 馬博拉斯山1500 - 秀姑巒山1600 - 白洋金礦山屋 行程定數: 45 (10小時) 住宿點: 白洋金礦山屋或前推到中央金礦山屋/巴奈伊克營地.  路線圖:Day 3:  白洋金礦山屋-東埔0600 - 白洋金礦山屋0800 - 八通關1200 - 觀高1600 - 東埔 行程定數: 22 (8小時) 路線圖:撤退路線: 由郡大林道撤回對關駐在所 (Day 1 路線原路撤回). 其他:  安全裝備: 頭盔, Garmin InReach衛星通訊, Garmin導航手表以及手機離線地圖.  聯絡方式: Garmin 衛星簡訊 裝備表: https://lighterpack. com/r/mh40pe天氣預測: 中央氣象局資料       Date   Location   Temperture   Weather         3/11   盆駒山   15°C 至 -2°C   多雲時晴       3/12   秀姑巒山   11°C 至 -3°C   多雲時晴       3/13   八通關山   9°C 至 -1°C   多雲時晴短暫雨   根據 Windy 資料(地點: 中央金礦山屋附近), 週日晚上以及週一中午可能會有微雨. 參考資料:  https://pttyes. com/Hiking/M. 1669170928. A. 51C https://moptt. tw/p/Hiking. M. 1663163464. A. FCE https://www. keepon. com. tw/thread-d2dd8d12-33e7-ec11-8173-901b0e54a4e6. html?Asp行程紀錄: Day 1: 0800 東埔吊橋出發 0820 玉山國家公園東埔服務中心報到完畢0920 雲龍瀑布1050 八通關9. 5K抵達對觀前, 崩塌嚴重. 1104 對觀駐在所, 開始上切稜線, 爬升約500m, 路跡清晰布條多. 1218 對關山稜線1254 郡大林道龍貓公車. 拍照, 大休約20min. 1322 郡大林道下切郡大溪, 2500m下切至1700m郡大溪底. 1449 抵達郡大支流溪底. 渡溪後休息半小時, 決定背水到盆駒山西稜2140m處過夜. 1530 於布農族耕地附近起攀, 陡峭異常, 落葉多, 幸好植被乾淨, 不需鑽箭竹或灌木叢. 1700 抵達2140m平台, 紮營休息. 晚上安靜涼爽, 氣溫4度且乾燥, 除了要背水上來外, 是一個舒服的過夜處. DAY1 回顧:: 行程 20. 8km, 爬升 2136m, 行程定數 42. 體感: 累, 但還在體能可負擔範圍內. 扣掉休息時間約走7小時50分, 與原本預估多了一個小時多, 但多推了400m爬升. 從郡大溪底續推到2140平台是一個正確的決定, 隔天少了一些爬升, 晚上也能安靜的休息, 需背水是唯一缺點. 晚餐吃府城香滷肉蛋+慈濟乾燥飯+溫泉蛋, 大約800cal熱量, 口感不錯. 列入以後登山糧食中. Day 2: 0720 營地出發. 0921 盆駒西稜陡的跟牆一樣, 加上落葉松針鋪滿植被, 沒跟上路跡的話會很難走. 0955 抵達盆駒谷, 休息 20min. 1030 盆駒山 3022m, 之後循傳統回馬博拉斯山1338 爬回馬博拉斯山途中, 海拔約 3500m. 不確定是否高山症, 此時有點反胃感, 體力也快速下滑, 遇到爬坡只能龜速慢慢走, 行程也嚴重 delay. 1556 花了5個多小時終於爬回馬博拉斯山, 身體沒特別不舒服, 就是有反胃感吃不太下東西, 也沒什麽體力, 狀況不佳, 確定會摸黑上秀姑巒山了. 1752 上秀姑巒山前的落日. 1909 終於龜速撐到秀姑巒山三角點 3825m, 這時還有好幾公里500多公尺的下坡要走, 偏偏狀況不佳又摸黑, 只能再放慢速度小心謹慎的走. 2030 終於抵達白洋金礦山屋, 今晚又是一個人包場整個山屋. 取水煮食, 約1030就寢. DAY2 回顧:: 行走時間13小時, 距離 18. 54km, 爬升 2431m, 行程定數 53. 9. 體感: 非常累, 已超出體能負荷之外. 早上的行程還算順利, 雖然盆駒西稜陡上不好走, 但不覺得超出體能範圍外; 回馬博拉斯山途中開始出狀況, 推估有兩個可能原因:  二月底 Covid 確診後體能一直沒調回來 (休息心跳居高不下, 比 Covid 前多了5-10次), 導致多天數行程體力不濟.  高山症. 一般來說除非直上 3300m 以上才會有類似徵狀, 但前一天已經在 2140m 處過夜, 應該可以當成高度適應. 之前有類似狀況是 2022 十一月多直接上南湖圈谷, 隔天發覺體力嚴重下滑, 只能快速下徹回登山口. 當然也有可能是這兩因素同時發生, 才讓第二天的行程產生嚴重拖延. 之後應該避免直上 3300m 以上地區, 並且在恢復體能 (休息心跳約41-43) 之前避免再上高山多天數行程. 晚餐是 Mounttain Food 的起士蝦仁菇菇飯, 口味還好, 跟台灣市面一般的乾燥飯一樣, 缺乏油脂. 自行添加了豬油跟溫泉蛋, 熱量約550卡. 晚上室外氣溫約2-3度, 室內約4度, 氣候乾燥. 白洋金礦山屋晚上有小動物跑來跑去, 半夜3點還有從中央金礦上來的山友開門進來, 用頭燈照來照去的…@@, 5點, 6點又分別來一批, 睡的不是很好. 可以的話, 我還是比較喜歡野外搭營. Day 3: 0717 山屋出發. 約莫5點多就被從中央金礦摸早黑的山友吵醒, 後來6點遇到2位是前天在八通關古道遇到的山友, 小聊了一下. 0726 往中央金礦山屋沿途山景, 此時還出大太陽, 南下的冷氣團還未至. 路程比想像中的還難, 稍有技術地形不成問題, 只是速度拉不快. 0839 中央金礦山屋, 山屋空無一人, 應該都出發往秀姑坪了. 0844 中央金礦山屋旁邊的溪水. 景觀蠻雅緻的, 要是夏天能在這邊烤肉應該會很愜意1012 抵達八通關草原. 雲霧開始聚集, 看來氣象局預測的冷氣團已經抵達了. 1043 取八通關舊路途中最危險崩塌處. 路基已完全流失, 只能沿著山壁往上攀, 再沿著有露出的岩塊慢慢橫渡過去. 比較麻煩的是風化的頁片岩並不穩故, 很多大力一拉就會剝落, 所以要當手點前必須先試一下穩固程度. 1056 舊路水源低繞處前的另一個崩塌, 這是我覺得第二危險的崩塌, 雖有拉繩, 但其中一端根本不牢靠, 加上位置偏外側, 拉繩反而會增加額外的危險. 中間有約一小段土石易滑落地形, 腳踩上去就會崩塌, 還好岩壁上的岩點還算穩固, 用手臂的力量分擔體重後就可以通過. 1110 抵達觀高. 觀高至對關 9. 0K 因長期乾旱而崩塌處處, 有些崩塌難度不亞於八通關舊路, 在春雨來臨前最好不要再來 1500 抵達愛玉亭. DAY3 回顧:: 行程一路順利, 八通關舊路輕裝通過有點危險性, 重裝就不建議. "
    }, {
    "id": 14,
    "url": "http://localhost:4000/%E8%83%BD%E9%AB%98%E5%AE%89%E6%9D%B1%E8%BB%8D(%E9%81%87%E7%81%AB%E7%81%BD%E6%92%A4%E9%80%80)/",
    "title": "20230225-20230226 能高安東軍(遇火災撤退)",
    "body": "2023/02/28 - 20130225 能高安東軍 (遇森林火災撤退)DAY1: 屯原 - 大陸池 (風大備案: 台灣池). 行程定數 40. 067, 預估10小時. https://connect. garmin. com/modern/course/146406910 DAY2: 大陸池 - 牡丹池. 行程定數 16. 103, 預估5小時. https://connect. garmin. com/modern/course/146406935 DAY3: 牡丹池 - 第二獵寮營地. 行程定數 30. 275, 預估10小時. https://connect. garmin. com/modern/course/146406954 DAY4: 第二獵寮營地 - 安東軍山 - 奧萬大. 行程定數 16. 59, 預估5小時. https://connect. garmin. com/modern/course/146406961 裝備列表: https://lighterpack. com/r/efe0eo 測試項目:  天氣預測: 以大陸池為基準點, D1-D2, -3度至7度,雲高約3000m,大陸池及牡丹池大部分為晴朗天氣, 清晨夜晚會有冰霜. D3-D4, 進入中級山高度, 多雲天氣.  0 ~ -5度裝備測試, 測試加入 sol bivy 當成 quilt 內袋的增溫效果.  alpha direct 90 + Patagonia Houdini windshell 行進效果.  Decalthon 防水噴霧在 gaitor 及越野鞋上的效果. 行程紀錄: Day 1: 前一天至奧萬大車宿. 0600 奧萬大上接駁車 0730 抵達屯原登山口 0830 抵達雲海保線所前土地公廟 0846 雲海保線所 0905 過崩壁 1044 天池山莊前吊橋. 1108 天池山莊, 小休約10分鐘補水. 1147 光被八表. 1431 過卡赫爾山後一片濃霧, 以及上能高主前的碎石坡. 1525 遇火災撤回天池山莊. Day1 回顧:: 前半天行程順利, 約3小時抵達天池山莊. 之後往能高主峰前進, 電塔前箭竹高且密集, 容易損傷衣物裝備. 離主峰前2-3公里就聞到濃濃的燒焦味, 由撤退的山友得知台灣池那邊箭竹起火, 評估之下決定撤回天池緊急避難. 前半天天氣晴朗, 後半天雲霧升起且高於3000公尺. 天池晚上溫度約4度, 穿著羽絨衣睡很舒服. Alpha direct90 + patagonia Houdini windshell 在強風下行進間非常舒服, 但是如果風小一點的話, 只需要 windshell 即可. 本日行程定數約 50. 8, 體感很累. Day 2: Day2 回顧:: 由天池山莊一路下撤, 十分順利. "
    }, {
    "id": 15,
    "url": "http://localhost:4000/%E6%96%B0%E5%BA%B7%E6%A9%AB%E6%96%B7/",
    "title": "20230106-20230109 新康橫斷",
    "body": "2023/01/06 - 20230106 新康橫斷行前根據windy預報, 雲層高度都在3千公尺以下, 加上週末冷氣團南下, 預計前三天在3千公尺的稜線上會是看雲海的好天氣, 只有最後一 晚會下降到雲霧底下, 預計會有小雨. 裝備表 https://lighterpack. com/r/3c3fz1 Day1: 0630從嘉明湖楊姐民宿接駁出發, 0830向陽起登.  1200到嘉明湖避難山屋, 途中遇到3人也是新康行下撤, 後來遇到山屋協作跟管理員才知, 因為前一晚沒睡好又太冷體力不支. 兩點到嘉明湖, 有雲有藍天, 遇到另一隊兩人. 路上偶遇下雨才有的草原乾淨看天池, 取水, 省了營地下切取水的時間. 約1600抵達布新營地, 擔心草原 風大, 再前行500公尺找個樹林圍繞的地點紮營.  晚上月圓高照, 微風徐徐, 溫度約0度上下. Day2: 0740起登, 一路往布拉克桑山前行, 沿路經過大大小小丘陵地形, 還有一個山豬打滾池. 約1015抵達布拉克桑山三角點, 沒有景觀隨便拍個登頂照就回程; 1225回到紮營處, 大休一個小時, 1330拔營往桃源營地. 途中稜線四周都是雲海, 遠方的山脈就像島嶼一般突出雲面, 路經軍機殘骸處, 心中默默祈禱後速速離去.  1730抵達桃源營地, 幸運在營地留有一壺水約2升多, 又省下下切取水的困擾. Day3: 0820收帳起登, 今天路程 garmin basecamp預估13公里, 遠比前兩天短的多, 因此預計今天應該算是相對輕鬆的行程, 結果卻不是如此. 一出發就是陡上連理山, 0949抵達連理山山頂. 沿途經過大大小小的稜線路跡清晰, 1056抵達新仙山前營地.  1130到達新仙山營地八通關下切點, 續行往新康山, 沿途除了上上下下的稜線須注意行進腳步, 還有一個50m高的崩壁, 需要用上不少的力量拉繩而下, 最後在陡上300m上新康山, 抵達三角點時已經1250, 此時已經知道待會下到抱崖山屋時可能會摸點小黑. 最後再往前天宮堡壘, 算是此行的最高潮, 藍天白雲一望無際的雲海, 盡收眼底. 回到仙山營地已經1440, 立即加速往八通關下切. 沿途森林巨木林立, 心裡想著原來台灣森林在大伐木時代前是這個樣子; 網路上傳聞這邊比塔魔巴的森林還美, 果然如此; 但心中也暗暗懊悔, 應該早點出發, 就有時間慢慢欣賞這片森林.  下到古道已經是1730天黑了, 摸黑了兩公里到抱崖山屋已經1800.  今天紀錄行程17. 6km, 跟原本預估的13. 7km相差了4公里遠, 猜測應該是今天的微地形太多, 導致距離估算失準這麼大. Day4: 0818山屋出發, 早上起床一抹彩虹橫跨藍紅相間的天空, 甚是特別. 八通關古道到瓦拉米山屋前大大小小的坍方不斷, 其中有兩處比較大的坍方有拉繩須特別注意, 其他都可以輕鬆通過.  行程至此, 背包重大約只剩4公斤出頭, 已經是我慣常越野跑的負重範圍內, 加上古道寬大, 不跑起來實在對不起自己平常的練習, 1505跑完28km出瓦拉米步道口. "
    }];

var idx = lunr(function () {
    this.ref('id')
    this.field('title')
    this.field('body')

    documents.forEach(function (doc) {
        this.add(doc)
    }, this)
});
function lunr_search(term) {
    document.getElementById('lunrsearchresults').innerHTML = '<ul></ul>';
    if(term) {
        document.getElementById('lunrsearchresults').innerHTML = "<p>Search results for '" + term + "'</p>" + document.getElementById('lunrsearchresults').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>No results found...</li>";
        }
    }
    return false;
}

function lunr_search(term) {
    $('#lunrsearchresults').show( 400 );
    $( "body" ).addClass( "modal-open" );
    
    document.getElementById('lunrsearchresults').innerHTML = '<div id="resultsmodal" class="modal fade show d-block"  tabindex="-1" role="dialog" aria-labelledby="resultsmodal"> <div class="modal-dialog shadow" role="document"> <div class="modal-content"> <div class="modal-header" id="modtit"> <button type="button" class="close" id="btnx" data-dismiss="modal" aria-label="Close"> &times; </button> </div> <div class="modal-body"> <ul class="mb-0"> </ul>    </div> <div class="modal-footer"><button id="btnx" type="button" class="btn btn-primary btn-sm" data-dismiss="modal">Close</button></div></div> </div></div>';
    if(term) {
        document.getElementById('modtit').innerHTML = "<h5 class='modal-title'>Search results for '" + term + "'</h5>" + document.getElementById('modtit').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><small><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></small></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>Sorry, no results found. Close & try a different search!</li>";
        }
    }
    return false;
}
    
$(function() {
    $("#lunrsearchresults").on('click', '#btnx', function () {
        $('#lunrsearchresults').hide( 5 );
        $( "body" ).removeClass( "modal-open" );
    });
});